content/docs/development/setup.md
+++
title = "Setup"
author = ["Fred Hebert", "Tristan Sloughter"]
description = "Adopting Erlang."
date = 2019-08-08T08:05:00+00:00
keywords = ["erlang"]
lastmod = 2024-07-13T10:52:08+00:00
draft = false
[menu]
  [menu.main]
    weight = 2002
    identifier = "setup"
    parent = "development"
+++

You can't write Erlang without having Erlang installed, so the unsurprising first steps covered in this chapter will be to go through the basic steps required to install Erlang/OTP on most major platforms. The instructions will aim for a basic set-up on most platforms, but you'll find out that real world Erlang development is rarely done with just the basic instructions.

In fact, as teams grow and they accumulate various projects, chances are that not all services, libraries, or bits of code will all support the same exact version of Erlang, and won't be upgraded all at once. If you talk to developers who use Erlang professionally, most (aside from Windows users) will tell you that they just compile their own copies with the options they need, and with a tool that lets them switch between multiple versions. So we'll go through that.

You will also see how to install Rebar3, the official build tool for the Erlang community, and base configurations for various text editors. In later chapters, we'll additionally talk about other tools that aren't specific to Erlang such as Kubernetes or Prometheus, but let's get started with Just Erlang for now.


## Installing Erlang/OTP {#installing-erlang-otp}

The first step is to get a proper install of Erlang/OTP in place. This is not going to be a uniform experience on all platforms, but we'll at least make sure everyone following these steps has a fully functioning setup for any work environment.


### Choosing a Version {#choosing-a-version}

Erlang/OTP is released on a fairly stable and predictable schedule, with well-defined criteria for backwards-incompatible changes.

Erlang versions are numbered according to a `<Major>.<Minor>.<Patch>` scheme, as described in the [Erlang/OTP system principles](http://erlang.org/doc/system_principles/versions.html#version_scheme). In some rare circumstances, other digits are bolted on as "branched" versions, which you likely won't have to care about.

Here are some example possible versions:

-   22.0
-   22.0-rc3
-   21.3
-   21.2.3
-   21.1
-   19.3
-   17.0
-   R16B03 (this is a legacy version format that hasn't been used since 2014)

As you can see, the `Patch` version is not mentioned when no patch is required. The release schedule for Erlang goes a bit like this:

1.  Once per year, around February or March, a release candidate for the next major version is announced (with a suffix such as `-rc1`, or `-rc2`). This release candidate is made available for users who want to build from source, in order to test that their applications and system will work well with it
2.  A few months later (April to June), the major release is cut and made public. Major releases contain large new features that require bigger virtual machine changes, and are also allowed to introduce backwards-incompatible changes
3.  At a frequency of every three or four months, a minor release is made public, which usually includes stability fixes and minor feature additions in individual libraries
4.  If a critical bug has been found in some circumstances, either for security or stability reasons, a patch release may be announced.

{{% admonition info %}}
Backwards incompatible changes are usually going through a cycle of deprecation before being removed, which tends to leave ample time to adapt. The policy is described in the <a href='http://erlang.org/doc/system_principles/misc.html'>Support, Compatibility, Deprecations, and Removal</a> document published by the OTP team at Ericsson.
{{% /admonition %}}

In some rare scenarios, hard-and-fast deprecations do happen (mostly by accident), and it may take a few weeks for the community to come up with workarounds.

A team that adopts Erlang will therefore likely want to adopt a maintenance schedule that fits the main releases if they want to avoid falling too far behind. While it is possible to only upgrade occasionally, you will find that it is often easier to do a bit of maintenance here and there than a lot of maintenance all at once.

Do note that patch-level releases are often only announced on the [mailing lists](http://erlang.org/mailman/listinfo/erlang-questions) and tagged on [the main git repository on GitHub](https://github.com/erlang/otp), but are otherwise not packaged on the main website.
