content/docs/development/setup.md


### Windows {#windows}

If you are a Windows user, it is recommended that you use Windows 10 for any Erlang development. Prior versions can work, but community tools such as Rebar3 are only tested on Windows 10, for example.

Building on Windows from source has been notoriously difficult, and it is therefore recommended that you stick to the pre-built copies.

If you are a user of [Chocolatey](https://chocolatey.org), you can grab the [Erlang](https://chocolatey.org/packages/erlang) packages, and install them as you wish, with commands such as:

<a id="code-snippet--choco"></a>
```sh
choco install erlang                   # for the latest
choco install erlang --version 21.2 -m # allow many versions
choco install erlang --version 20.1 -m # and one more versions
```

This will add all the versions you want to your `PATH` variable, which you will then need to maintain in the right order.

Without Chocolatey, use binaries distributed on [www.erlang.org/downloads](https://www.erlang.org/downloads), or alternatively those built by [Erlang Solutions Ltd.](https://www.erlang-solutions.com/resources/download.html).

The installer for these versions comes with a wizard that will take you through all the required steps.

Do not forget to add Erlang/OTP to your `PATH` variable to contain your Erlang/OTP installation, since this will let you call it from the command-line:

1.  In the start menu, search for "system environment variables" and select the "Edit the System and Environment Variables (Control Panel)" option
2.  At the bottom of the "System Properties" window that has just open, press the "Environment Variables..." button
3.  Select the `Path` variable (or create it if it does not exist) and click the "Edit" button
4.  Add an entry for Erlang/OTP that matches the installation path, usually something like `C:\Program Files\erl10.2\bin`. The entries put earlier in the list will be loaded first.
5.  Save the options
6.  Close and restart any terminal you were running.

If you do development in the long term, you will be able to install multiple versions that way. You can control which one is used by changing and modifying the `PATH` variable's priorities in paths.

If you are a purist when it comes to Windows development, you may be quite comfortable in an environment such as Visual Studio, where pretty much everything can be done from within the IDE. Erlang comes from a different environment, and a lot of the instructions we'll use in this book are focused on using the command line to build everything.

If you are looking for a terminal to run the command line on Windows, various options are available:

-   Use PowerShell as a terminal. Most commands in this book should work fine with it, but some edge cases may exist.
-   Download and install [git for Windows](https://git-scm.com/download/win), which will come with a `git-bash` shell that will work well with all tooling and most commands in this book
-   Try [ConEmu](https://www.fosshub.com/ConEmu.htm) as a nicer terminal emulator to work with
-   Use [Cmder](https://cmder.net/) which is a Windows console emulator that packages most of the above options rather well
-   Use [Cygwin](https://www.cygwin.com) at your own risk; you will need to rebuild your software from source to work well with it, and tools like Rebar3 dynamically figure out they're on Windows, which historically has caused a few path problems when interacting with Cygwin

You can then use the editor or IDE of your choosing to work with Erlang components.


### OSX {#osx}

While OSX makes it possible to use [Homebrew](https://brew.sh/) or [Erlang Solutions Ltd. packages](https://www.erlang-solutions.com/resources/download.html) to install pre-built versions of Erlang/OTP, you should only do so if you're trying things out the first time around. If you're planning on doing actual development for the longer haul, you'll instead want to be able to handle multiple versions at once.

The most commonly supported tool for this is [kerl](https://github.com/kerl/kerl). Kerl is a wrapper around downloading, compiling, and loading various Erlang/OTP versions on a single system, and will abstract away most annoying operations.

You can install Kerl from homebrew by calling `$ brew install kerl`, or by following the instructions in its [README file](https://github.com/kerl/kerl#downloading).

Before installing Erlang, we will need to install and update a few dependencies, the main ones being to make sure you have [XCode](https://developer.apple.com/xcode/) installed and to then install OpenSSL (since OSX has terribly outdated copies of SSL by default):

<a id="code-snippet--openssl-osx"></a>
```sh
$ brew install openssl
...
$ ls /usr/local/Cellar/openssl/
1.0.2q
```

Note the full path this gives you for the local openssl install, here being `/usr/local/Cellar/openssl/1.0.2q/`

You can set the following options in your environment:

<a id="code-snippet--kerlcfg-osx"></a>
```sh
SSL_PATH=/usr/local/Cellar/openssl/1.0.2q/
export KERL_BUILD_BACKEND="git"
export KERL_CONFIGURE_OPTIONS="--without-javac \
                               --with-dynamic-trace=dtrace \
                               --with-ssl=${SSL_PATH}"
```

And ensure it's active (for example, call `source ~/.bashrc`). These options specify what is accepted or expected from the build tool. The one here disables Java bindings, and uses the new SSL install we've made. You can look at the [Build Instructions](https://github.com/erlang/otp/blob/master/HOWTO/INSTALL.md#configuring-1) for more configuration options.

If you want to add more content, such as `Wx` (which lets you use and build GUIs), the [Build instructions for OSX](https://github.com/erlang/otp/blob/master/HOWTO/INSTALL.md#os-x-darwin) contain further details to guide you.

From that point on, you can download and install your own Erlang/OTP versions:

<a id="code-snippet--kerl-osx"></a>
```sh
$ kerl update releases
...
