content/docs/development/setup.md
# kerl build <release> <build name>
$ kerl build 21.3 21.3
...
# kerl install <build name> <target path>
$ kerl install 21.3 ~/bin/erls/21.3/
...
# make that version active
$ . ~/bin/erls/21.3/activate
# or alternatively
$ source ~/bin/erls/21.3/activate
```

Any installed version can then be activated on-demand. If you want to set a default version, you can put the activation command in your `.bashrc` configuration file (or any shell profile you might have).

If you are planning on using both Erlang and Elixir on your development machine, you might want to take a look at [`asdf`](https://asdf-vm.com/#/core-manage-asdf-vm). It is a plugin-based installer for multiple programming languages, and can handle both Elixir and Erlang at once. You may need to install the `autoconf` package to make it work.

To use it with Erlang, install the [Erlang plugin](https://github.com/asdf-vm/asdf-erlang) by calling `asdf plugin-add erlang https://github.com/asdf-vm/asdf-erlang.git`. This plugin wraps `kerl` and reuses all of its options, but transfers the builds under `asdf`'s control. As such, the previous configuration instructions remain the same. You just have to change the sequence of calls for:

<a id="code-snippet--asdf-linux"></a>
```sh
# asdf install erlang <version>
$ asdf install erlang 21.3
...
# asdf global <name> <version> [<version>...]
# asdf local <name> <version> [<version>...]
# export ASDF_ERLANG_VERSION=<version>
```

The main difference between `kerl` and `asdf` from there on is that `kerl` will use environment variables to know which version to run, and `asdf` will optionally use a `.tool-versions` file to trigger the change on a per-directory basis.


### Linux {#linux}

Linux distributions pretty much all have package managers that let you install pre-built copies of Erlang, or you can still use [Erlang Solutions Ltd. packages](https://www.erlang-solutions.com/resources/download.html). Much like with OSX though, you should only do so if you're trying things out the first time around. If you're planning on doing actual development for the longer haul, you'll instead want to be able to handle multiple versions at once.

The most commonly supported tool for this is [kerl](https://github.com/kerl/kerl). Kerl is a wrapper around downloading, compiling, and loading various Erlang/OTP versions on a single system, and will abstract away most annoying operations.

You can install kerl by calling:

<a id="code-snippet--linux-kerl"></a>
```sh
$ curl -O https://raw.githubusercontent.com/kerl/kerl/master/kerl
$ chmod a+x kerl
```

And then moving kerl to your path. Kerl will automatically check and warn you about missing dependencies you might be needing when building libraries, so you can just go ahead and run the following commands, and listen to its directions as you go.

First, you can set options as follows in your environment:

<a id="code-snippet--kerlcfg-linux"></a>
```sh
export KERL_BUILD_BACKEND="git"
export KERL_CONFIGURE_OPTIONS="--without-javac \
                               --with-dynamic-trace=systemtap"
```

And ensure it's active (for example, call `source ~/.bashrc`). These options specify what is accepted or expected from the build tool. The one here disables Java bindings, but they would be skipped automatically anyway. You can look at the [Build Instructions](https://github.com/erlang/otp/blob/master/HOWTO/INSTALL.md#configuring-1) for more configuration options.

If you want to add more content, such as `Wx` (which lets you use and build GUIs), the [Build instructions for Wx](https://github.com/erlang/otp/blob/master/HOWTO/INSTALL.md#building-with-wxerlang) contain further details to guide you.

From that point on, you can download and install your own Erlang/OTP versions:

<a id="code-snippet--kerl-linux"></a>
```sh
$ kerl update releases
...
# kerl build <release> <build name>
$ kerl build 21.3 21.3
...
# kerl install <build name> <target path>
$ kerl install 21.3 ~/bin/erls/21.3/
...
# make that version active
$ . ~/bin/erls/21.3/activate
# or alternatively
$ source ~/bin/erls/21.3/activate
```

Any installed version can then be activated on-demand. If you want to set a default version, you can put the activation command in your `.bashrc` configuration file (or any shell profile you might have).

If you are planning on using both Erlang and Elixir on your development machine, you might want to take a look at [`asdf`](https://asdf-vm.com/#/core-manage-asdf-vm). It is a plugin-based installer for multiple programming languages, and can handle both Elixir and Erlang at once. You may need to install the `autoconf` package to make it work.

To use it with Erlang, install the [Erlang plugin](https://github.com/asdf-vm/asdf-erlang) by calling `asdf plugin-add erlang https://github.com/asdf-vm/asdf-erlang.git`. This plugin wraps `kerl` and reuses all of its options, but transfers the builds under `asdf`'s control. As such, the previous configuration instructions remain the same. You just have to change the sequence of calls for:

<a id="code-snippet--asdf-osx"></a>
```sh
# asdf install erlang <version>
$ asdf install erlang 21.3
...
# asdf global <name> <version> [<version>...]
# asdf local <name> <version> [<version>...]
# export ASDF_ERLANG_VERSION=<version>
```

The main difference between `kerl` and `asdf` from there on is that `kerl` will use environment variables to know which version to run, and `asdf` will optionally use a `.tool-versions` file to trigger the change on a per-directory basis.


### FreeBSD {#freebsd}

On FreeBSD, the experience with `kerl` (as reported in other sections) has been hit and miss. Sometimes, some patches are required to make things work as smoothly as on other platforms. The good news is that if you use either the BSD [ports](https://www.freebsd.org/doc/en/books/handbook/ports-using.html) or [packages](https://www.freebsd.org/doc/en/books/handbook/pkgng-intro.html), it will all work fine out of the box.

This is the easiest way forwards, but makes switching across versions a bit trickier since you don't get an Erlang version manager for free. However, BSD ports and packages do let you build any version supported at your liking.

For example you can call any of the following:

<a id="code-snippet--bsd-install"></a>
```sh
# pkg install erlang # default copy
# pkg install erlang-runtime20  # OTP-20.x
# ls /usr/ports/lang/erlang* # source install: pick the version directory
erlang/
...
erlang-runtime20/
erlang-runtime21/
erlang-wx/
# cd /usr/ports/lang/erlang-runtime21/
# make config-recursive     # configure all the deps
# make install
```

FreeBSD maintainers are generally good about ensuring things keep working fine on the main supported architectures, so if you're sticking to x86 and avoid ARM, you should have no major issues.


### Making things Nice {#making-things-nice}

Before you're done, you should go to your shell or terminal profile, and add a few environment variables. Specifically, you can use `ERL_AFLAGS` or `ERL_ZFLAGS` to add configuration switches to the `erl` executable at all times.

We'll use `ERL_AFLAGS` to turn on two neat features: outputting strings with Unicode support by default, and enabling shell history so that the Erlang shell remembers your commands between invocations. Add the following to your environment:

<a id="code-snippet--erl-aflags"></a>
```sh
export ERL_AFLAGS="+pc unicode -kernel shell_history enabled"
```

Things will feel a bit more modern that way.


## Installing Rebar3 {#installing-rebar3}

Rebar3 is the standard build tool within the Erlang community. It essentially bundles all of the other tools shipping with Erlang along with a few open-source ones, and makes them all work under a unified project structure.

There are a few ways to install Rebar3: from a pre-built binary, or from source, and then a last variant for a faster-running local install. Do note that in all cases, you need Erlang to have been installed already.
